#pragma once
#ifndef HIT_TEST_H
#define HIT_TEST_H

#include "struct.h"
#include "polygon.h"
#include "variable.h"

void Judgment()
{
	// 右のあたり判定
	if (v[1].x > 625 && v[2].x > 625)
	{
		v[0].x -= 5.0f;
		v[1].x -= 5.0f;
		v[2].x -= 5.0f;
		v[3].x -= 5.0f;
	}
	// 左のあたり判定
	if (v[0].x < 0 && v[3].x < 0)
	{
		v[0].x += 5.0f;
		v[1].x += 5.0f;
		v[2].x += 5.0f;
		v[3].x += 5.0f;
	}

	// 地面のあたり判定
	if ((v[2].y > 200 && v[3].y > 200) && (( 625 > v[2].x > 350 ) && ( 575 > v[3].x > 450 )))
	{
		GravityCount = 0;
		v[0].y = 150;
		v[1].y = 150;
		v[2].y = 200;
		v[3].y = 200;

	}else if ((v[2].y > 341 && v[3].y > 341) && (250 < v[2].x < 350) && (v[3].x < 250))
	{
		GravityCount = 0;
		v[0].y = 291;
		v[1].y = 291;
		v[2].y = 341;
		v[3].y = 341;
	}
	else if (v[2].y > 441 && v[3].y > 441)
	{
		GravityCount = 0;
		v[0].y = 391;
		v[1].y = 391;
		v[2].y = 441;
		v[3].y = 441;
	}
	// ブロック 1 のあたり判定
		// 左のあたり判定
	if ((v[0].x < 250.2f && v[3].x < 250.2f) && v[3].y > 341)
	{
		v[0].x += 5.0f;
		v[1].x += 5.0f;
		v[2].x += 5.0f;
		v[3].x += 5.0f;
	}

	// ブロック2の当たり判定
	    // 下の当たり判定
 /*	if (((  160 < v[0].y < 270 ) && ( 160 < v[1].y < 270) && ((v[0].x > 300))))
	{
		v[0].y = 270;
		v[1].y = 270;
		v[2].y = 320;
		v[3].y = 320;
	}*/
	    // 左の当たり判定
	/*if ((( 350 < v[1].x & v[1].x < 625) && (350 < v[2].x & v[2].x < 625)) && 
		(( 150 < v[1].y)))
	{
		v[0].x = 300;
		v[1].x = 350;
		v[2].x = 350;
		v[3].x = 300;
	}*/
	  // 上の当たり判定
	if ((v[0].x > 350 && v[1].x < 680 ) && ( v[0].y > 200 && v[3].y < 400 ) )
	{
		GravityCount = 0;
		/*SpeedCount = 0;*/
		v[0].y = 150;
		v[1].y = 150;
		v[2].y = 200;
		v[3].y = 200;
	}
}


#endif // DEBUG

